'''s = int(input("Введите сообщение для Алисы:  "))
while True:
    type = type(s)
    print(type)
    if type == int:
        print('Yes')
    s = int(input("Введите сообщение для Алисы:  "))
print('No')
'''


'''
try:
    x1 = int(input('Введите число'))
    x2 = int(input('Введите число'))
    print(f'x1/x2 = {x1/x2}')
except ZeroDivisionError:
    print('Делить на ноль нельзя')
except ValueError:
    print('Можно вводить только число!')
'''
'''
print('Три девицы под окном \n Пряли поздно вечерком. "Кабы я была царица, - молвит старшая сестрица,- Я б на весь крещенный мир Приготовила бы...')
ch_1 = input('Выберите вариант: ', v1_1, '/', v1_2, '/', v1_3, '/', v1_4)
v1_1 = 'пир'
v1_2 =' консоме из лягушачьих лапок с соусом фуагра'
v1_3 = 'тыквенный латте с семенами чиа'
v1_4 = 'ничего'
print('"Кабы я была царица, - молвит средняя сестрица,- Я на весь бы мир одна наткала бы...')
ch_2 = input('Выберите вариант: ', v2_1, '/', v2_2, '/', v2_3, '/', v2_4))
v2_1 = 'полотна'
v2_2 = 'паутину'
v2_3 = ''
v2_4 = ''

print('Лучшая идея ля прокрастинации')
'отправить другу смешную гифку'
    'посмотреть скидки на авиабилеты'
    'разобраться, о чём поют рэперы'
     'Юрий Дудь',
    'расставить книги на полке по цвету'
     'читать про зарплаты в Сан-Франциско'
    'прочитать новости и ужаснуться в комментариях',
    'попасть в поток грустных песен и вспомнить все ошибки молодости'
     'посмотреть трейлер сериала и заодно первый сезон'
    'проверить непрочитанное в Telegram-каналах'
'''
ch1=input('Выберите из нескольких вариантов: баба/ Сергей "Шнур" / Президент России')
ch2 = input('Выберите из нескольких вариантов: Ряба/ Терминатор / Чебурашка')
ch3 = input('Выберите из нескольких вариантов: яичко / колонку Алису/ автомат Калашникова')
ch4 = input('Выберите из нескольких вариантов: золотое/ деревянное / термоядерное')
print(f'Жил-были дед да {ch1}.\n '
      f'И была у них курочка {ch2}. \n '
      f'Снесла курочка {ch3}\n'
      f'{ch3} не простое — {ch4}\n'
      f'Дед бил, бил - \n'
      f'Не разбил.\n'
      f'{ch1} била-била —\n'
      f'Не разбила.)\n'
      f'Мышка бежала,\n'
       f'Хвостиком махнула,\n'
       f'{ch3} упало и разбилось.\n'
       f'Дед плачет, \n'
       f'{ch1} плачет,\n'
       f'Курочка кудахчет:\n'
       f'«Не плачь, дед, не плачь, \n'
       f'{ch1}!Я снесу вам {ch3} другое,\n'
       f'Не {ch4} — простое».')











